// ВВЕДЕНИЕ В ФУНКЦИИ
// https://learn.javascript.ru/function-basics#obyavlenie-funktsii

// ОБЪЯВЛЕНИЕ И ВЫЗОВ
    // Выбор имени функции
    // Локальные переменные
    // Внешние переменные
    // Глобальные переменные

// ПАРАМЕТРЫ И АРГУМЕНТЫ
    // Параметр – это переменная, указанная в круглых скобках в объявлении функции.
    // Аргумент – это значение, которое передаётся функции при её вызове.
    // Значения по умолчанию

// КЛЮЧЕВОЕ СЛОВО RETURN
    // Возврат значения (пустая функция возвращает undefined)

// ФУНКЦИОНАЛЬНЫЕ ВЫРАЖЕНИЯ



// !!! Одна функция – одно действие
// !!! Сверхкороткие имена функций - не стоит т.к Функции == Комментарии
// https://learn.javascript.ru/function-expressions
// https://learn.javascript.ru/arrow-functions-basics